Rhino.Render.RenderContent.RegisterContent(System.Reflection.Assembly,System.Guid)
Render content is automatically registered for the Assembly that a plug-in is defined in. If
you have content defined in a different assembly (for example a Grasshopper component), then
you need to explicitly call RegisterContent.
assembly: Assembly where custom content is defined.
pluginId: Parent plug-in for this assembly.
Returns: array of render content types registered on success. null on error.

Rhino.Render.RenderContent.OnAddUserInterfaceSections
Override this function to provide UI sections to display in the editor.

Rhino.Render.RenderContent.GetShader(System.Guid,System.IntPtr)
See C++ RDK documentation - this is a passthrough function that gives access to your own
native shader.  .NET clients will more likely simply check the type of their content and call their own
shader access functions
If you overide this function, you must ensure that you call "IsCompatible" and return IntPtr.Zero is that returns false.
renderEngineId: The render engine requesting the shader.
privateData: A pointer to the render engine's own context object.
Returns: A pointer to the unmanaged shader.

Rhino.Render.RenderContent.ChildSlotNameFromParamName(System.String)
A "child slot" is the specific "slot" that a child (usually a texture) occupies.
This is generally the "use" of the child - in other words, the thing the child
operates on.  Some examples are "color", "transparency".
paramName: The name of a parameter field. Since child textures will usually correspond with some
parameter (they generally either replace or modify a parameter over UV space) these functions are used to
specify which parameter corresponded with with child slot.  If there is no correspondance, return the empty
string.
Returns:
The default behaviour for these functions is to return the input string.
Sub-classes may (in the future) override these functions to provide different mappings.

Rhino.Render.RenderContent.TypeName
Override this method to provide a name for your content type.  ie. "My .net Texture"

Rhino.Render.RenderContent.TypeDescription
Override this method to provide a description for your content type.  ie.  "Procedural checker pattern"

Rhino.Render.RenderContent.InDocument
Returns true if this content is a resident of one of the persistant lists.