Rhino.Render.RenderMesh.PrimitiveType
Call this before extracting meshes. Although the Mesh property
will always work correctly no matter what the primitive type is,
if your renderer supports rendering any of these primitives, you can
extract the data using the Sphere, Plane, Cone and Box properties.

Rhino.Render.RenderMesh.Mesh
Returns the mesh associated with the object.

Rhino.Render.RenderMesh.Sphere
Returns a sphere if this object represents a primitive sphere, or null.

Rhino.Render.RenderMesh.IsLegacyMaterial
Implmented as !IsRenderMaterial - the material is always either a RenderMaterial or a Legacy material (Rhino.DocObjects.Material)

Rhino.Render.RenderMesh.Material
Will return null if "IsRenderMaterial" returns false.