Rhino.Render.ContentList
Base class that provides access to the document lists of RenderContent instances
ie - the Material, Environment and Texture tables.

Rhino.Render.ContentList.FindInstance(System.Guid,System.Boolean)
Finds a content by its instance id.
instanceId: Instance id of the content to find.
includeChildren: Specifies if children should be searched as well as top-level content.
Returns: The found content or null.

Rhino.Render.ContentList.Count
The number of top level content objects in this list.

Rhino.Render.ContentList.Id
The unique identifier for this list.

Rhino.Render.ContentList.ContentListClearing
Used to monitor content lists being cleared.

Rhino.Render.ContentList.ContentListCleared
Used to monitor content lists being cleared.

Rhino.Render.ContentList.ContentListLoading
Used to monitor content lists being loading.