Rhino.Render.CustomRenderMesh.Manager.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,Rhino.Render.CustomRenderMesh.MeshTypes,System.Guid)
Determines if custom render meshes will be built for a particular object.
vp: the viewport being rendered.
obj: the Rhino object of interest.
requestingPlugIn: type of mesh to build.
meshType: UUID of the plug-in requesting the meshes.
soleProviderId: the UUID of the sole provider to call.
Returns: true if BuildCustomMeshes() will build custom render mesh(es) for the given object.

Rhino.Render.CustomRenderMesh.Manager.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,Rhino.Render.CustomRenderMesh.MeshTypes)
Determines if custom render meshes will be built for a particular object.
vp: the viewport being rendered.
obj: the Rhino object of interest.
requestingPlugIn: type of mesh to build.
meshType: UUID of the plug-in requesting the meshes.
Returns: true if BuildCustomMeshes() will build custom render mesh(es) for the given object.

Rhino.Render.CustomRenderMesh.Manager.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,Rhino.Render.CustomRenderMesh.MeshTypes,System.Guid)
Returns a bounding box for the custom render meshes for the given object.
vp:  the viewport being rendered.
obj: Rhino object of interest.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
meshType:  type of mesh(es) to build the bounding box for.
soleProviderId: the sole provider to call.
Returns: ON_BoundingBox for the meshes.

Rhino.Render.CustomRenderMesh.Manager.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,Rhino.Render.CustomRenderMesh.MeshTypes)
Returns a bounding box for the custom render meshes for the given object.
vp:  the viewport being rendered.
obj: Rhino object of interest.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
meshType:  type of mesh(es) to build the bounding box for.
Returns: ON_BoundingBox for the meshes.

Rhino.Render.CustomRenderMesh.Manager.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMesh.ObjectMeshes,System.Guid,Rhino.Render.CustomRenderMesh.MeshTypes,System.Guid)
Build custom render mesh(es) for the given object.
vp: the viewport being rendered.
objMeshes: The meshes object to fill with custom meshes - the Object property will already be set.
requestingPlugIn: the UUID of the RDK plug-in requesting the meshes.
meshType:  type of mesh(es) to build.
soleProviderId: the sole provider to call.
Returns: true if successful.

Rhino.Render.CustomRenderMesh.Manager.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMesh.ObjectMeshes,System.Guid,Rhino.Render.CustomRenderMesh.MeshTypes)
Build custom render mesh(es) for the given object.
vp: the viewport being rendered.
objMeshes: The meshes object to fill with custom meshes - the Object property will already be set.
requestingPlugIn: the UUID of the RDK plug-in requesting the meshes.
meshType:  type of mesh(es) to build.
Returns: true if successful.

Rhino.Render.CustomRenderMesh.Manager.CustomRenderMeshesChanged
Monitors when custom render meshes are changed.