Rhino.DocObjects.RhinoObject.RenderMaterialInstanceId
Gets the instance ID of the render material associated with this object.

Rhino.DocObjects.RhinoObject.Decals
Gets all object decals associated with this object.