Rhino.Render.Utilities.RdkMajorVersion
Returns the RDK_MAJOR_VERSION this RDK was built with.
Returns: The Rdk major version.

Rhino.Render.Utilities.RdkMinorVersion
Returns the RDK_MINOR_VERSION this RDK was built with.
Returns: The Rdk minor version.

Rhino.Render.Utilities.RdkBetaRelease
Returns the RDK_BETA_RELEASE this RDK was built with.
Returns: The Rdk beta release.

Rhino.Render.Utilities.NewBasicMaterial(Rhino.DocObjects.Material)
Constructs a new basic material from a Material.
material: The material to create the basic material from.
Returns: A new basic material.

Rhino.Render.Utilities.NewBasicEnvironment(Rhino.Render.SimulatedEnvironment)
Constructs a new Rhino.Render.RenderEnvironment from a Rhino.Render.SimulatedEnvironment.
environment: The environment to create the basic environment from.
Returns: A new basic environment.

Rhino.Render.Utilities.NewBitmapTexture(Rhino.Render.SimulatedTexture)
Constructs a new basic texture from a SimulatedTexture.
texture: The texture to create the basic texture from.
Returns: A new render texture.

Rhino.Render.Utilities.CreateContentByType(System.Guid,Rhino.Render.Utilities.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and add it to the persistent content list.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
type: Is the type of the content to add.
flags: Options for the tab.
doc: The current Rhino document.
Returns: A new persistent render content.

Rhino.Render.Utilities.CreateContentByType(System.Guid,Rhino.Render.RenderContent,System.String,Rhino.Render.Utilities.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and add it to the persistent content list.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
type: is the type of the content to add.
parent: Parent is the parent content. If not NULL, this must be an RDK-owned content that is
in the persistent content list (either top-level or child). The new content then becomes its child.
If NULL, the new content is added to the top-level content list instead.
childSlotName: ChildSlotName is the unique child identifier to use for the new content when creating it as a child of pParent (i.e., when pParent is not NULL)
flags: Options for the tab.
doc: The current Rhino document.
Returns: A new persistent render content.

Rhino.Render.Utilities.MaterialList(Rhino.RhinoDoc)
Accesses the material table.
doc: A Rhino document.
Returns: The materials list.

Rhino.Render.Utilities.EnvironmentList(Rhino.RhinoDoc)
Accesses the environment table.
doc: A Rhino document.
Returns: The environments list.

Rhino.Render.Utilities.TextureList(Rhino.RhinoDoc)
Accesses the texture table.
doc: A Rhino document.
Returns: The textures list.

Rhino.Render.Utilities.LoadPersistantRenderContentFromFile(System.String)
Loads a content from a library file.  Adds the content to the persistent content list.
filename: is the full path to the file to be loaded.
Returns: The loaded content or null if an error occurred.

Rhino.Render.Utilities.LoadRenderContentFromFile(System.String)
Loads a content from a library file.  Does not add the content to the persistent content list.  Use AddPersistantContent to add it to the list.
filename: is the full path to the file to be loaded.
Returns: The loaded content or null if an error occurred.

Rhino.Render.Utilities.AddPersistentRenderContent(Rhino.Render.RenderContent)
Use this function to add a material, environment or texture to the internal
RDK document lists as a top level content.  The content must have been returned from
RenderContent::MakeCopy, NewContentFromType or a similar function that returns a non-document
content.
renderContent: The render content.
Returns: true on success.

Rhino.Render.Utilities.FindFile(System.String)
Finds a file and also handles network shares.
Remarks: This is a replacement for CRhinoFileUtilities::FindFile().
fullPathToFile: The file to be found.
Returns: The found file.

Rhino.Render.Utilities.RdkVersion
Returns the RDK_SDK_VERSION this RDK was built with.

Rhino.Render.Utilities.RdkBuildDate
Returns the build date of this RDK - implemented as return __DATE__;

Rhino.Render.Utilities.IsMaterialEditorVisible
Queries whether or not the material editor is visible.

Rhino.Render.Utilities.IsEnvironmentEditorVisible
Queries whether or not the environment editor is visible.

Rhino.Render.Utilities.IsTexturePaletteVisible
Queries whether or not the texture palette is visible.

Rhino.Render.Utilities.IsSunDockBarVisible
Queries whether or not the sun dock bar is visible.

Rhino.Render.Utilities.IsViewDockBarVisible
Queries whether or not the view dock bar is visible.

Rhino.Render.Utilities.IsSafeFrameEnabled
Queries whether or not the Safe Frame is visible.