Rhino.Render.RenderPipeline.NewRenderMeshIterator(Rhino.DocObjects.ViewportInfo,System.Boolean)
A new render mesh iterator.
The caller shall dispose the iterator.
Meshes created by the iterator are accessible up till when the iterator is disposed.
forceTriMesh: true if quad meshes should be triangulated.
vp: The rendering view camera.
Returns: A render mesh iterator.
//TODO - ON_Viewport