Rhino.PlugIns.RenderPlugIn.AllowChooseContent(Rhino.Render.RenderContent)
Default implementation returns true which means the content can be
picked from the content browser by the user. Override this method and
return false if you don't want to allow a certain content type to be
picked from the content browser while your render engine is current.
content: A render context.
Returns: true if the operation was successful.