Rhino.Render.Decal.Color(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Display.Color4f@,Rhino.Geometry.Point2d@)
Blend color with the decal color at a given point.
point: The point in space or, if the decal is uv-mapped, the uv-coordinate of that point.
normal: The face normal of the given point.
colInOut: The color to blend the decal color to.
uvOut: the UV on the texture that the color point was read from.
Returns: true if the given point hits the decal, else false.

Rhino.Render.Decal.MappingType
Gets the mapping of the decal.

Rhino.Render.Decal.ProjectionType
Gets the decal's projection. Used only when mapping is planar.

Rhino.Render.Decal.Radius
Gets thhe radius of the decal. Only used when mapping is cylindrical or spherical.

Rhino.Render.Decal.LatStart
Gets the start latitude of the decal's sweep. Only used when mapping is cylindrical or spherical.

Rhino.Render.Decal.LatEnd
Gets the stop latitude of the decal's sweep. Only used when mapping is cylindrical or spherical.

Rhino.Render.Decal.LonStart
Gets the start longitude of the decal's sweep. Only used when mapping is spherical.

Rhino.Render.Decal.LonEnd
Gets the stop longitude of the decal's sweep. Only used when mapping is spherical.