Rhino.Render.ContentUndoHelper.#ctor(System.String)
Constructs a ContentUndoHelper object inside a using block to handle undo when modifying a RenderContent
or - alternatively - create the ContentUndoHelper and explicitly call Dispose when you are done.
description: Undo description (which appears in the UI when undo is run)

Rhino.Render.ContentUndoHelper.AddContent(Rhino.Render.RenderContent)
Call this *after* adding a content. Undo will cause the content to be deleted.
content: Content you just added to the ContentList.
Returns: true if the content was added.