Rhino.Render.CustomRenderMesh.Provider.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,Rhino.Render.CustomRenderMesh.MeshTypes)
Determines if custom render meshes will be built for a particular object.
vp: The viewport being rendered.
obj: The Rhino object of interest.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
meshType: Type of mesh to build.
Returns: true if custom meshes will be built.

Rhino.Render.CustomRenderMesh.Provider.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,Rhino.Render.CustomRenderMesh.MeshTypes)
Returns a bounding box for the custom render meshes for the given object.
vp: The viewport being rendered.
obj: The Rhino object of interest.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
meshType: Type of mesh to build.
Returns: A bounding box value.

Rhino.Render.CustomRenderMesh.Provider.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMesh.ObjectMeshes,System.Guid,Rhino.Render.CustomRenderMesh.MeshTypes)
Build custom render mesh(es).
vp: The viewport being rendered.
objMeshes: The meshes class to populate with custom meshes.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
meshType: Type of mesh to build.
Returns: true if operation was successful.